# Agregar o Eliminar datos

In [16]:
import pandas as pd
import numpy as np

In [8]:
df = pd.read_csv('./data/bestsellers-with-categories.csv')

In [9]:
df.head()

,Name,Author,User Rating,Reviews,Price,Year,Genre
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,2016,Non Fiction
1,11/22/63: A Novel,Stephen King,4.6,2052,22,2011,Fiction
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15,2018,Non Fiction
3,1984 (Signet Classics),George Orwell,4.7,21424,6,2017,Fiction
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12,2019,Non Fiction

In [10]:
# 0 son filas y 1 son columnas
# usar inplace para que lo guarde directamente en el df original
df.drop('Genre', axis=1 ,
        inplace= True)

In [11]:
# El inplace se puede reemplazar usando
df = df.drop('Year',axis=1)

In [12]:
df.columns

Index(['Name', 'Author', 'User Rating', 'Reviews', 'Price'], dtype='object')

In [13]:
df.head(3)

,Name,Author,User Rating,Reviews,Price
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8
1,11/22/63: A Novel,Stephen King,4.6,2052,22
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15

In [14]:
# Eliminó el libro `10-Day Green Smoothie Cleanse`
df.drop(0, axis=0).head(3)

,Name,Author,User Rating,Reviews,Price
1,11/22/63: A Novel,Stephen King,4.6,2052,22
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15
3,1984 (Signet Classics),George Orwell,4.7,21424,6

## Agregar nueva columna

In [22]:
df.head(5)

,Name,Author,User Rating,Reviews,Price
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8
1,11/22/63: A Novel,Stephen King,4.6,2052,22
2,12 Rules for Life: An Antidote to Chaos,Jordan B. Peterson,4.7,18979,15
3,1984 (Signet Classics),George Orwell,4.7,21424,6
4,"5,000 Awesome Facts (About Everything!) (Natio...",National Geographic Kids,4.8,7665,12

In [17]:
df.shape

(550, 5)

In [21]:
rango = np.arange(0,550)

In [22]:
rango.shape

(550,)

In [25]:
# Agregar una columna que viene de un numpy
df['NuevaColumna'] = rango

In [33]:
df.head(2)

,Name,Author,User Rating,Reviews,Price,NuevaColumna
0,10-Day Green Smoothie Cleanse,JJ Smith,4.7,17350,8,0
1,11/22/63: A Novel,Stephen King,4.6,2052,22,1

In [35]:
df.shape

(550, 6)

In [39]:
# agregar rows
print(df.shape)
df = pd.concat([df,df])
print(df.shape)

(550, 6)
(1100, 6)